In [26]:
import pandas as pd
import numpy as np

In [27]:
school_data_to_load = "C:/Users/lorib/Desktop/Pandas_Challenge-master/schools_complete.csv"
student_data_to_load = "C:/Users/lorib/Desktop/Pandas_Challenge-master/students_complete.csv"

In [28]:
school_data_df = pd.read_csv(school_data_to_load)
school_data_df.head()
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [31]:
# Combine the data into a single dataset
school_data_complete = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
#school_data_complete.head()
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [32]:
#create df for math
mathscores_df= pd.DataFrame()

In [33]:
#adding school name index to mathdf
schoolName=school_data_df['school_name'].values
mathscores_df["school_name"] = schoolName
print(mathscores_df)

              school_name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [34]:
#sorting
mathscores_df=mathscores_df.sort_values(by='school_name').reset_index(drop=True)
print(mathscores_df)

              school_name
0      Bailey High School
1     Cabrera High School
2    Figueroa High School
3        Ford High School
4     Griffin High School
5   Hernandez High School
6      Holden High School
7       Huang High School
8     Johnson High School
9        Pena High School
10  Rodriguez High School
11    Shelton High School
12     Thomas High School
13     Wilson High School
14     Wright High School

In [35]:
#9thgrade data
grade_9 = school_data_complete[(school_data_complete["grade"] == "9th")]
grade_9= grade_9.sort_values(by='school_name').reset_index(drop=True)
grade_9_group=grade_9.groupby('school_name')
print(grade_9_group)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000014453FB8E80>

In [36]:
#adding 9th to df
avg9th_math_score= grade_9_group['math_score'].mean().values
mathscores_df['9th'] = avg9th_math_score
print(mathscores_df)

              school_name        9th
0      Bailey High School  77.083676
1     Cabrera High School  83.094697
2    Figueroa High School  76.403037
3        Ford High School  77.361345
4     Griffin High School  82.044010
5   Hernandez High School  77.438495
6      Holden High School  83.787402
7       Huang High School  77.027251
8     Johnson High School  77.187857
9        Pena High School  83.625455
10  Rodriguez High School  76.859966
11    Shelton High School  83.420755
12     Thomas High School  83.590022
13     Wilson High School  83.085578
14     Wright High School  83.264706

In [39]:
#10thgrade data
grade_10 = school_data_complete[(school_data_complete["grade"] == "10th")]
grade_10= grade_10.sort_values(by='school_name').reset_index(drop=True)
grade_10_group=grade_10.groupby('school_name')
print(grade_10_group)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000014455B9C710>

In [41]:
#adding 10th to df
avg10th_math_score= grade_10_group['math_score'].mean().values
mathscores_df['10th'] = avg10th_math_score
print(mathscores_df)

              school_name        9th       10th
0      Bailey High School  77.083676  76.996772
1     Cabrera High School  83.094697  83.154506
2    Figueroa High School  76.403037  76.539974
3        Ford High School  77.361345  77.672316
4     Griffin High School  82.044010  84.229064
5   Hernandez High School  77.438495  77.337408
6      Holden High School  83.787402  83.429825
7       Huang High School  77.027251  75.908735
8     Johnson High School  77.187857  76.691117
9        Pena High School  83.625455  83.372000
10  Rodriguez High School  76.859966  76.612500
11    Shelton High School  83.420755  82.917411
12     Thomas High School  83.590022  83.087886
13     Wilson High School  83.085578  83.724422
14     Wright High School  83.264706  84.010288

In [42]:
#11thgrade data
grade_11 = school_data_complete[(school_data_complete["grade"] == "11th")]
grade_11= grade_11.sort_values(by='school_name').reset_index(drop=True)
grade_11_group=grade_11.groupby('school_name')
print(grade_11_group)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000014455B9C2B0>

In [43]:
#adding 11th to df
avg11th_math_score= grade_11_group['math_score'].mean().values
mathscores_df['11th'] = avg11th_math_score
print(mathscores_df)

              school_name        9th       10th       11th
0      Bailey High School  77.083676  76.996772  77.515588
1     Cabrera High School  83.094697  83.154506  82.765560
2    Figueroa High School  76.403037  76.539974  76.884344
3        Ford High School  77.361345  77.672316  76.918058
4     Griffin High School  82.044010  84.229064  83.842105
5   Hernandez High School  77.438495  77.337408  77.136029
6      Holden High School  83.787402  83.429825  85.000000
7       Huang High School  77.027251  75.908735  76.446602
8     Johnson High School  77.187857  76.691117  77.491653
9        Pena High School  83.625455  83.372000  84.328125
10  Rodriguez High School  76.859966  76.612500  76.395626
11    Shelton High School  83.420755  82.917411  83.383495
12     Thomas High School  83.590022  83.087886  83.498795
13     Wilson High School  83.085578  83.724422  83.195326
14     Wright High School  83.264706  84.010288  83.836782

In [44]:
#12thgrade data
grade_12= school_data_complete[(school_data_complete["grade"] == "12th")]
grade_12= grade_12.sort_values(by='school_name').reset_index(drop=True)
grade_12_group=grade_12.groupby('school_name')
print(grade_12_group)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000014455B9C3C8>

In [55]:
#adding 12th to df
avg12th_math_score= grade_12_group['math_score'].mean().values
mathscores_df['12th'] = avg12th_math_score
print(mathscores_df)

              school_name        9th       10th       11th       12th
0      Bailey High School  77.083676  76.996772  77.515588  76.492218
1     Cabrera High School  83.094697  83.154506  82.765560  83.277487
2    Figueroa High School  76.403037  76.539974  76.884344  77.151369
3        Ford High School  77.361345  77.672316  76.918058  76.179963
4     Griffin High School  82.044010  84.229064  83.842105  83.356164
5   Hernandez High School  77.438495  77.337408  77.136029  77.186567
6      Holden High School  83.787402  83.429825  85.000000  82.855422
7       Huang High School  77.027251  75.908735  76.446602  77.225641
8     Johnson High School  77.187857  76.691117  77.491653  76.863248
9        Pena High School  83.625455  83.372000  84.328125  84.121547
10  Rodriguez High School  76.859966  76.612500  76.395626  77.690748
11    Shelton High School  83.420755  82.917411  83.383495  83.778976
12     Thomas High School  83.590022  83.087886  83.498795  83.497041
13     Wilson High School  83.085578  83.724422  83.195326  83.035794
14     Wright High School  83.264706  84.010288  83.836782  83.644986

In [57]:
mathscores_df= mathscores_df.sort_values(by='school_name').reset_index(drop=True)
mathscores_df

              school_name        9th       10th       11th       12th
0      Bailey High School  77.083676  76.996772  77.515588  76.492218
1     Cabrera High School  83.094697  83.154506  82.765560  83.277487
2    Figueroa High School  76.403037  76.539974  76.884344  77.151369
3        Ford High School  77.361345  77.672316  76.918058  76.179963
4     Griffin High School  82.044010  84.229064  83.842105  83.356164
5   Hernandez High School  77.438495  77.337408  77.136029  77.186567
6      Holden High School  83.787402  83.429825  85.000000  82.855422
7       Huang High School  77.027251  75.908735  76.446602  77.225641
8     Johnson High School  77.187857  76.691117  77.491653  76.863248
9        Pena High School  83.625455  83.372000  84.328125  84.121547
10  Rodriguez High School  76.859966  76.612500  76.395626  77.690748
11    Shelton High School  83.420755  82.917411  83.383495  83.778976
12     Thomas High School  83.590022  83.087886  83.498795  83.497041
13     Wilson High School  83.085578  83.724422  83.195326  83.035794
14     Wright High School  83.264706  84.010288  83.836782  83.644986

In [46]:
#create df for reading
readingscores_df= pd.DataFrame()

In [47]:
#adding school name index to readingdf
schoolName=school_data_df['school_name'].values
readingscores_df["school_name"] = schoolName
print(readingscores_df)

              school_name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [48]:
#sorting
readingscores_df=readingscores_df.sort_values(by='school_name').reset_index(drop=True)
print(readingscores_df)

              school_name
0      Bailey High School
1     Cabrera High School
2    Figueroa High School
3        Ford High School
4     Griffin High School
5   Hernandez High School
6      Holden High School
7       Huang High School
8     Johnson High School
9        Pena High School
10  Rodriguez High School
11    Shelton High School
12     Thomas High School
13     Wilson High School
14     Wright High School

In [49]:
#9thgrade data
grade_9= school_data_complete[(school_data_complete["grade"] == "9th")]
grade_9= grade_9.sort_values(by='school_name').reset_index(drop=True)
grade_9_group= grade_9.groupby('school_name')
print(grade_9_group)
#adding 9th to df
avg9th_reading_score= grade_9_group['reading_score'].mean().values
readingscores_df['9th']= avg9th_reading_score
print(readingscores_df)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000001445614D208>
              school_name        9th
0      Bailey High School  81.303155
1     Cabrera High School  83.676136
2    Figueroa High School  81.198598
3        Ford High School  80.632653
4     Griffin High School  83.369193
5   Hernandez High School  80.866860
6      Holden High School  83.677165
7       Huang High School  81.290284
8     Johnson High School  81.260714
9        Pena High School  83.807273
10  Rodriguez High School  80.993127
11    Shelton High School  84.122642
12     Thomas High School  83.728850
13     Wilson High School  83.939778
14     Wright High School  83.833333

In [50]:
#10thgrade data
grade_10= school_data_complete[(school_data_complete["grade"] == "10th")]
grade_10= grade_10.sort_values(by='school_name').reset_index(drop=True)
grade_10_group=grade_10.groupby('school_name')
print(grade_10_group)
#adding 10th to df
avg10th_reading_score= grade_10_group['reading_score'].mean().values
readingscores_df['10th'] = avg10th_reading_score
print(readingscores_df)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000001445614D160>
              school_name        9th       10th
0      Bailey High School  81.303155  80.907183
1     Cabrera High School  83.676136  84.253219
2    Figueroa High School  81.198598  81.408912
3        Ford High School  80.632653  81.262712
4     Griffin High School  83.369193  83.706897
5   Hernandez High School  80.866860  80.660147
6      Holden High School  83.677165  83.324561
7       Huang High School  81.290284  81.512386
8     Johnson High School  81.260714  80.773431
9        Pena High School  83.807273  83.612000
10  Rodriguez High School  80.993127  80.629808
11    Shelton High School  84.122642  83.441964
12     Thomas High School  83.728850  84.254157
13     Wilson High School  83.939778  84.021452
14     Wright High School  83.833333  83.812757

In [51]:
#11thgrade data
grade_11 = school_data_complete[(school_data_complete["grade"] == "11th")]
grade_11= grade_11.sort_values(by='school_name').reset_index(drop=True)
grade_11_group=grade_11.groupby('school_name')
print(grade_11_group)
#adding 10th to df
avg11th_reading_score= grade_11_group['reading_score'].mean().values
readingscores_df['11th'] = avg11th_reading_score
print(readingscores_df)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000001445614D048>
              school_name        9th       10th       11th
0      Bailey High School  81.303155  80.907183  80.945643
1     Cabrera High School  83.676136  84.253219  83.788382
2    Figueroa High School  81.198598  81.408912  80.640339
3        Ford High School  80.632653  81.262712  80.403642
4     Griffin High School  83.369193  83.706897  84.288089
5   Hernandez High School  80.866860  80.660147  81.396140
6      Holden High School  83.677165  83.324561  83.815534
7       Huang High School  81.290284  81.512386  81.417476
8     Johnson High School  81.260714  80.773431  80.616027
9        Pena High School  83.807273  83.612000  84.335938
10  Rodriguez High School  80.993127  80.629808  80.864811
11    Shelton High School  84.122642  83.441964  84.373786
12     Thomas High School  83.728850  84.254157  83.585542
13     Wilson High School  83.939778  84.021452  83.764608
14     Wright High School  83.833333  83.812757  84.156322

In [52]:
#12thgrade data
grade_12= school_data_complete[(school_data_complete["grade"] == "12th")]
grade_12= grade_12.sort_values(by='school_name').reset_index(drop=True)
grade_12_group=grade_12.groupby('school_name')
print(grade_12_group)
#adding 10th to df
avg12th_reading_score= grade_12_group['reading_score'].mean().values
readingscores_df['12th'] = avg12th_reading_score
print(readingscores_df)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000014455B9C278>
              school_name        9th       10th       11th       12th
0      Bailey High School  81.303155  80.907183  80.945643  80.912451
1     Cabrera High School  83.676136  84.253219  83.788382  84.287958
2    Figueroa High School  81.198598  81.408912  80.640339  81.384863
3        Ford High School  80.632653  81.262712  80.403642  80.662338
4     Griffin High School  83.369193  83.706897  84.288089  84.013699
5   Hernandez High School  80.866860  80.660147  81.396140  80.857143
6      Holden High School  83.677165  83.324561  83.815534  84.698795
7       Huang High School  81.290284  81.512386  81.417476  80.305983
8     Johnson High School  81.260714  80.773431  80.616027  81.227564
9        Pena High School  83.807273  83.612000  84.335938  84.591160
10  Rodriguez High School  80.993127  80.629808  80.864811  80.376426
11    Shelton High School  84.122642  83.441964  84.373786  82.781671
12     Thomas High School  83.728850  84.254157  83.585542  83.831361
13     Wilson High School  83.939778  84.021452  83.764608  84.317673
14     Wright High School  83.833333  83.812757  84.156322  84.073171

In [58]:
readingscores_df= readingscores_df.sort_values(by='school_name').reset_index(drop=True)
readingscores_df

              school_name        9th       10th       11th       12th
0      Bailey High School  81.303155  80.907183  80.945643  80.912451
1     Cabrera High School  83.676136  84.253219  83.788382  84.287958
2    Figueroa High School  81.198598  81.408912  80.640339  81.384863
3        Ford High School  80.632653  81.262712  80.403642  80.662338
4     Griffin High School  83.369193  83.706897  84.288089  84.013699
5   Hernandez High School  80.866860  80.660147  81.396140  80.857143
6      Holden High School  83.677165  83.324561  83.815534  84.698795
7       Huang High School  81.290284  81.512386  81.417476  80.305983
8     Johnson High School  81.260714  80.773431  80.616027  81.227564
9        Pena High School  83.807273  83.612000  84.335938  84.591160
10  Rodriguez High School  80.993127  80.629808  80.864811  80.376426
11    Shelton High School  84.122642  83.441964  84.373786  82.781671
12     Thomas High School  83.728850  84.254157  83.585542  83.831361
13     Wilson High School  83.939778  84.021452  83.764608  84.317673
14     Wright High School  83.833333  83.812757  84.156322  84.073171